
// 하노이 타워

/* ------------------------------------------------------------------------------------------------------------

#include <stdio.h>

void Hanoi(int n, char from, char by, char to) {
	if (n == 1)												
		printf("원반 %d를 %c에서 %c로 이동\n", n, from, to);
	else {
		Hanoi(n - 1, from, to, by);
		printf("원반 %d를 %c에서 %c로 이동\n", n, from, to);
		Hanoi(n - 1, by, from, to);
	}
}

int main(void) {
	// 막대 A의 원반 3개를 막대 B를 경유하여 막대 C로 옮기기
	Hanoi(3, 'A', 'B', 'C');
	return 0;
}

------------------------------------------------------------------------------------------------------------ */
